In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['1C','2C','3C','4C'])

In [7]:
df  #Creating a DataFrame(Data, key=(row), Column(label))

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
#The rows and Column are pandas series

In [9]:
#Indexing.... selecting columns
df['1C']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: 1C, dtype: float64

In [10]:
type(df['1C'])

pandas.core.series.Series

In [13]:
df[['1C','3C']]   #Multiple Columns , by passing a list of list

         1C        3C
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [14]:
df

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
#Creating a new Column  - Use other Columns with arithmetics to create a new Column

In [16]:
df['5C'] = df['1C'] + df['2C']

In [17]:
df

         1C        2C        3C        4C        5C
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [20]:
#Removing a Column, need to specify the axis to be 1 and  but axis not required for Row
#use the drop function NB: removing permanently requires inplace argument to be true

In [21]:
df.drop('5C', axis =1)

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df   #Calling df automatically shows th column wasnt removed in memory

         1C        2C        3C        4C        5C
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [24]:
df.drop('5C', inplace = True, axis =1)

In [25]:
df

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df.drop('C')

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.shape

(5, 4)

In [29]:
# Selecting Row

In [31]:
df.loc['A']   
#through the name

1C    2.706850
2C    0.628133
3C    0.907969
4C    0.503826
Name: A, dtype: float64

In [33]:
df.iloc[0]  #through indexing

1C    2.706850
2C    0.628133
3C    0.907969
4C    0.503826
Name: A, dtype: float64

In [34]:
df

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df.loc['B', '3C']

-0.8480769834036315

In [37]:
df.loc[['A','B'],['1C', '3C']]

         1C        3C
A  2.706850  0.907969
B  0.651118 -0.848077

In [38]:
#Conditional selection...
df

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df > 0

      1C     2C     3C     4C
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [41]:
df[df>0]

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
#Returning only the column with numbers > 0
#by passing a series

In [44]:
result = df[df['1C'] >0]   #Filter

In [45]:
result

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
result['3C']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: 3C, dtype: float64

In [47]:
df

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
#working with multiple conditions &  and  |

In [49]:
df[(df['1C']>0) & (df['3C'] >1)]  #automatically should return row E where 1C >0 and 3C is >1

         1C        2C        3C        4C
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df[(df['1C']>0) | (df['3C'] >1)]

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df

         1C        2C        3C        4C
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df.reset_index()    #inplace = True will happen inplace and overides the prev DataFrame

  index        1C        2C        3C        4C
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [57]:
newind = 'A B C D E'.split()

In [58]:
newind

['A', 'B', 'C', 'D', 'E']

In [59]:
df['newind'] = newind

In [69]:
df   #10 steps ago i performed df.set_index('newind', inplace = True)

              1C        2C        3C        4C
newind
A       2.706850  0.628133  0.907969  0.503826
B       0.651118 -0.319318 -0.848077  0.605965
C      -2.018168  0.740122  0.528813 -0.589001
D       0.188695 -0.758872 -0.933237  0.955057
E       0.190794  1.978757  2.605967  0.683509

In [70]:
df

              1C        2C        3C        4C
newind
A       2.706850  0.628133  0.907969  0.503826
B       0.651118 -0.319318 -0.848077  0.605965
C      -2.018168  0.740122  0.528813 -0.589001
D       0.188695 -0.758872 -0.933237  0.955057
E       0.190794  1.978757  2.605967  0.683509